[
  {
    "nickname": "cuixiaorui",
    "account": "cui_xiaorui",
    "avatar": "/commentsImgs/cuixiaorui.jpg",
    "link": "",
    "comment": "Earthworm is more than just a tool; It's a journey into the heart of language learning, making every sentence and conjunction an adventure. With its addictive gameplay, it's not just an exercise, it's a daily habit that invites you to take a deeper look at the richness of the English language!",
    "chinese": " Earthworm 不仅仅是一个工具;这是一次进入语言学习核心的旅程，让每个句子和连词都成为一次冒险。凭借其令人上瘾的游戏玩法，它不仅是一种练习，而且是一种日常习惯，邀请您更深入地了解英语的丰富性！",
    "time": 1708423574717,
    "likeCount": 1342
  },
  {
    "nickname": "fengstats",
    "account": "fengstats",
    "avatar": "/commentsImgs/fengstats.png",
    "link": "",
    "comment": "I am simply fascinated by this app! This progressive way of learning makes each stage full of challenges, but also gives me a strong sense of achievement. I have been unable to stop the pace of learning, I am eager to make a little progress, I hope you can climb another tall building!",
    "chinese": "我简直被这款应用迷住了！这种渐进式的学习方式，让每个阶段都充满挑战，同时也让我有了一种强烈的成就感。我已经不能停下学习的脚步，我渴望一点点的进步，希望能更上一层楼！",
    "time": 1708409873687,
    "likeCount": 197
  },
  {
    "nickname": "zclsx",
    "account": "jiushi21",
    "avatar": "/commentsImgs/zclsx.jpg",
    "link": "",
    "comment": "This application overcomes the boredom of English learning. I can't stop brushing courses now.",
    "chinese": "这个应用克服了英语学习的枯燥，我现在刷课程刷得停不下来。",
    "time": 1706005913747,
    "likeCount": 79
  },
  {
    "nickname": "Nauxscript",
    "account": "Nauxscript",
    "avatar": "/commentsImgs/Nauxscript.jpg",
    "link": "",
    "comment": "Now I go through the app every day and I feel that my English has improved by leaps and bounds, which is fun and fulfilling. I hope to be able to join and share after studying like me, it will be addictive!",
    "chinese": "现在我每天都要浏览这个应用程序，我觉得我的英语突飞猛进，有趣又充满成就感。我希望能够加入和我一样学习后进行打卡分享，会上瘾的！",
    "time": 1706931528936,
    "likeCount": 520
  },
  {
    "nickname": "Ims",
    "account": "Immersecode",
    "avatar": "/commentsImgs/yaolifeng0629.jpg",
    "link": "",
    "comment": "Such interesting and fulfilling English learning application, it is really overwhelming. I practice it every day now, it has become a habit. Awesome!",
    "chinese": "如此有趣又充实的英语学习应用，真是让人不知所措。我现在每天都在练习，这已经成为一种习惯。棒！",
    "time": 1706863861905,
    "likeCount": 98
  },
  {
    "nickname": "vampirewy",
    "account": "vampirewy",
    "avatar": "/commentsImgs/vampirewy.jpg",
    "link": "",
    "comment": "Through sentence splitting, I feel that I have a deeper understanding of sentences after brushing the lessons. The feeling is subtle, and when I open it the next day, it gets smoother every time!",
    "chinese": "通过句子拆分进行学习，我感觉我刷课之后，对句子的理解更加深刻。这种感觉是潜移默化的，当我第二天打开，每次都会变得更加流畅！",
    "time": 1704763341161,
    "likeCount": 86
  },
  {
    "nickname": "hildxd",
    "account": "hildxd",
    "avatar": "/commentsImgs/hildxd.jpg",
    "link": "",
    "comment": "I have never been so enthusiastic about learning as I am now. This app really makes learning so interesting that every learning is like a challenge that I can't resist. It's such a great feeling that I can keep brushing the course without getting bored.",
    "chinese": "再也没有像现在这样，我对学习如此充满热情。这个应用真是把学习变得如此有趣，每一次学习都像是一种挑战，让我无法抗拒。这种感觉太棒了，我能够一直刷课程而不觉得无聊",
    "time": 1709913419937,
    "likeCount": 486
  },
  {
    "nickname": "zuowendong",
    "account": "zuowendong",
    "avatar": "/commentsImgs/zuowendong.jpg",
    "link": "",
    "comment": "I really can't resist the magic of this English learning application of conjunctions and sentences. When I am free every day, I will habitually open this app and can't help but challenge myself. This is a new way of entertainment for me!",
    "chinese": "我真的无法抵抗这款连词造句的英语学习应用的魔力，每天闲下来的时候，我都会习惯性地打开这款应用，忍不住去挑战一下自己，这对我来说是一种全新的娱乐方式！",
    "time": 1708567188968,
    "likeCount": 232
  },
  {
    "nickname": "Hazel-Lin",
    "account": "HazelLin",
    "avatar": "/commentsImgs/Hazel-Lin.jpg",
    "link": "",
    "comment": "I didn't expect that learning English could be so interesting. I can't stop the way this conjunction makes sentences.",
    "chinese": "真没想到学习英语可以这么有趣，这个连词造句的方式简直让我停不下来。",
    "time": 1703189419913,
    "likeCount": 78
  }
]
